;; -*- mode: emacs-lisp; coding: utf-8 -*-

;;-----------------------------------------------------------------
;; wdired
;; http://www.bookshelf.jp/soft/meadow_25.html#SEC292
;;-----------------------------------------------------------------
;; 例えば、拡張子 cpp を cxx に変更したいとすれば
;; M - % で確認置換を起動し、cpp -> cxx と置換すればOK
;; 更にうれしいのは、例えば test.cpp をバッファとして開いていたとして、
;; それを test.cxx にリネームした場合にバッファを
;; test.cxx として開き直してくれる点です。
;; http://d.hatena.ne.jp/higepon/20061226/1167098839
;;-----------------------------------------------------------------
(require 'wdired)

;;-----------------------------------------------------------------
;; rでdiredバッファを直接編集できるようになる。
;;-----------------------------------------------------------------
(define-key dired-mode-map "r" 'wdired-change-to-wdired-mode)

;;-----------------------------------------------------------------
;;パーミッションも変更可能に
;;-----------------------------------------------------------------
(setq wdired-allow-to-change-permissions t)

;;-----------------------------------------------------------------
;; dired で編集後に SKK をオフ (SKK は使わないのでコメントアウト)
;;-----------------------------------------------------------------
;(defadvice wdired-finish-edit
;  (after skk-no-use activate)
;  (skk-auto-fill-mode -1))
